5a6
> - -1664901176
10d10
< - 5
12c12
< 2
---
> 1
15,18c15,18
< 5
< foo::m called [1]
< foo::m const called [5]
< 2
---
> 4
> foo::m called [-1664901176]
> foo::m const called [4]
> 1
21,22d20
< 5
< 4
23a22
> 3
25,29c24,27
< 2
< foo::m called [5]
< foo::m const called [1]
< 4
< 4
---
> 1
> -1664901176
> foo::m called [4]
> foo::m const called [-1664901176]
30a29
> 2
31a31
> -1664901176
